demo_app/app/views/users/show.html.erb

<ul>
	<% @user.microposts.each do |microposts| %>
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]